###############################################################################
# Created by write_sdc
###############################################################################
current_design Half_Adder
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 
set_input_delay 0.1000 -add_delay [get_ports {in1}]
set_input_delay 0.1000 -add_delay [get_ports {in2}]
set_output_delay 0.1000 -add_delay [get_ports {cout}]
set_output_delay 0.1000 -add_delay [get_ports {sum}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
